### 1. DataFrame

In [91]:
import numpy as np
import pandas as pd


- 생성 방법: 1, 2차원 데이터, 컬럼, 인덱스

In [92]:
df1 = pd.DataFrame(
    np.random.randint(40,101,12).reshape(4,3),  #2차원 데이터
    columns = list('XYZ'),                      #컬럼명
    index = list('abcd')                        #인덱스명
)
df1

    X   Y   Z
a  52  58  99
b  88  74  57
c  82  48  99
d  40  58  50

- 생성 방법 2: 딕셔너리의 리스트

In [93]:
data = [
    {'X':83, 'Y': 59, 'Z': 53},
    {'X':45, 'Y': 59, 'Z': 45},
    {'X':50, 'Y': 89, 'Z': 98},
    {'X':100, 'Y': 46, 'Z': 77},
]
df2 = pd.DataFrame(data, index = list('abcd'))
df2

     X   Y   Z
a   83  59  53
b   45  59  45
c   50  89  98
d  100  46  77

- 생성 방법 3: 데이터가 value, 컬럼명이 key가 되는 딕셔너리

In [94]:
data = {
    'X':[83,45,50,100],
    'Y':[59,59,89,46],
    'Z':[53,45,98,77] 
}
df3 = pd.DataFrame(data, index = list('abcd'))
df3

     X   Y   Z
a   83  59  53
b   45  59  45
c   50  89  98
d  100  46  77

In [95]:
data = {
    "2015": [9904312, 3448737, 2890451, 2466052],
    "2010": [9631482, 3393191, 2632035, 2431774],
    "2005": [9762546, 3512547, 2517680, 2456016],
    "2000": [9853972, 3655437, 2466338, 2473990],
    "지역": ["수도권", "경상권", "수도권", "경상권"],
    "2010-2015 증가율": [0.0283, 0.0163, 0.0982, 0.0141]
}
columns = ["지역", "2015", "2010", "2005", "2000", "2010-2015 증가율"]
index = ["서울", "부산", "인천", "대구"]
df = pd.DataFrame(data, index=index, columns=columns)
df

     지역     2015     2010     2005     2000  2010-2015 증가율
서울  수도권  9904312  9631482  9762546  9853972         0.0283
부산  경상권  3448737  3393191  3512547  3655437         0.0163
인천  수도권  2890451  2632035  2517680  2466338         0.0982
대구  경상권  2466052  2431774  2456016  2473990         0.0141

In [96]:
df.values

array([['수도권', 9904312, 9631482, 9762546, 9853972, 0.0283],
       ['경상권', 3448737, 3393191, 3512547, 3655437, 0.0163],
       ['수도권', 2890451, 2632035, 2517680, 2466338, 0.0982],
       ['경상권', 2466052, 2431774, 2456016, 2473990, 0.0141]], dtype=object)

In [97]:
df.columns

Index(['지역', '2015', '2010', '2005', '2000', '2010-2015 증가율'], dtype='object')

In [98]:
df.index

Index(['서울', '부산', '인천', '대구'], dtype='object')

In [99]:
df.index.name = '도시'
df.columns.name = '항목'
df

항목   지역     2015     2010     2005     2000  2010-2015 증가율
도시
서울  수도권  9904312  9631482  9762546  9853972         0.0283
부산  경상권  3448737  3393191  3512547  3655437         0.0163
인천  수도권  2890451  2632035  2517680  2466338         0.0982
대구  경상권  2466052  2431774  2456016  2473990         0.0141

In [100]:
a,b,c,d,e =[1,2,3,4,5]

In [101]:
data = [
    {'A':a+a,'B':a+b,'C':a+c,'D':a+d, 'E':a+e,},
    {'A':b+a,'B':b+b,'C':b+c,'D':b+d, 'E':b+e,},
    {'A':c+a,'B':c+b,'C':c+c,'D':c+d, 'E':c+e,},
    {'A':d+a,'B':d+b,'C':d+c,'D':d+d, 'E':d+e,},
    {'A':e+a,'B':e+b,'C':e+c,'D':e+d, 'E':e+e,}
]
df2 = pd.DataFrame(data, index = list('ABCDE'))
df2

   A  B  C  D   E
A  2  3  4  5   6
B  3  4  5  6   7
C  4  5  6  7   8
D  5  6  7  8   9
E  6  7  8  9  10

In [102]:
chr(65)+chr(91)

'A['

In [103]:
col_A, col_B, col_C, col_D, col_E = [], [], [], [], []
np.random.seed = 2023
for i in range(5):
    col_A.append(chr(np.random.randint(65,91))+ chr(np.random.randint(65,91)))
    col_B.append(np.random.randint(1,7))
    col_C.append(np.random.randint(40,101))
    col_D.append(np.random.randint(1,100)*100)
    col_E.append(np.round(np.random.rand(), 4))
df4 = pd.DataFrame(
    {'col_A':col_A, 'col_B':col_B,'col_C':col_C,'col_D':col_D,'col_E':col_E}
)
df4

  col_A  col_B  col_C  col_D   col_E
0    SM      5     77   3200  0.2907
1    IU      4     84   8100  0.8548
2    JM      2    100   3800  0.2470
3    MN      2     61   2500  0.7056
4    CO      2     99   3400  0.4132

In [104]:

np.random.seed = 2023
data = []
for i in range(5):
    d ={
        'col_A': (chr(np.random.randint(65,91))+ chr(np.random.randint(65,91))),
        'col_B': (np.random.randint(1,7)),
        'col_C': (np.random.randint(40,101)),
        'col_D': (np.random.randint(1,100)*100),
        'col_E': (np.round(np.random.rand(), 4))
    }
    data.append(d)
df5 = pd.DataFrame(data)
df5

  col_A  col_B  col_C  col_D   col_E
0    ZX      1     84    500  0.9809
1    QT      5     43   1500  0.0906
2    VQ      5     63   7100  0.2518
3    KQ      2     75   9800  0.7545
4    JX      4     60   4200  0.3104

- 전치(Transpose)

In [105]:
df1.T

    a   b   c   d
X  52  88  82  40
Y  58  74  48  58
Z  99  57  99  50

In [106]:
df5.T

            0       1       2       3       4
col_A      ZX      QT      VQ      KQ      JX
col_B       1       5       5       2       4
col_C      84      43      63      75      60
col_D     500    1500    7100    9800    4200
col_E  0.9809  0.0906  0.2518  0.7545  0.3104

- 열(col) 데이터의 갱신, 추가, 삭제

In [107]:
df

항목   지역     2015     2010     2005     2000  2010-2015 증가율
도시
서울  수도권  9904312  9631482  9762546  9853972         0.0283
부산  경상권  3448737  3393191  3512547  3655437         0.0163
인천  수도권  2890451  2632035  2517680  2466338         0.0982
대구  경상권  2466052  2431774  2456016  2473990         0.0141

In [108]:
df['2010-2015 증가율']= df['2010-2015 증가율'] * 100
df

항목   지역     2015     2010     2005     2000  2010-2015 증가율
도시
서울  수도권  9904312  9631482  9762546  9853972           2.83
부산  경상권  3448737  3393191  3512547  3655437           1.63
인천  수도권  2890451  2632035  2517680  2466338           9.82
대구  경상권  2466052  2431774  2456016  2473990           1.41

In [109]:
# 열 이름이 있으면 갱신, 없으면 생성
df['2005-2010 증가율'] = ((df['2010'] - df['2005']) / df['2005'] * 100).round(2)
df

항목   지역     2015     2010     2005     2000  2010-2015 증가율  2005-2010 증가율
도시
서울  수도권  9904312  9631482  9762546  9853972           2.83          -1.34
부산  경상권  3448737  3393191  3512547  3655437           1.63          -3.40
인천  수도권  2890451  2632035  2517680  2466338           9.82           4.54
대구  경상권  2466052  2431774  2456016  2473990           1.41          -0.99

In [110]:
# 열 삭제
del df['2010-2015 증가율']

In [111]:
df

항목   지역     2015     2010     2005     2000  2005-2010 증가율
도시
서울  수도권  9904312  9631482  9762546  9853972          -1.34
부산  경상권  3448737  3393191  3512547  3655437          -3.40
인천  수도권  2890451  2632035  2517680  2466338           4.54
대구  경상권  2466052  2431774  2456016  2473990          -0.99

- 열 인덱싱

In [112]:
df['지역']         #열 이름을 하나만 선택하면 시리즈로 반환

도시
서울    수도권
부산    경상권
인천    수도권
대구    경상권
Name: 지역, dtype: object

In [114]:
df[['2015','2010']]       #열 이름을 여러개의 리스트로 입력하면 데이터프레임으로 반환된다.

항목     2015     2010
도시
서울  9904312  9631482
부산  3448737  3393191
인천  2890451  2632035
대구  2466052  2431774

In [116]:
df[['2015']]        # 하나의 리스트를 입력해도 데이터프레임으로 반환된다.

항목     2015
도시
서울  9904312
부산  3448737
인천  2890451
대구  2466052

- 개별 인덱싱

In [120]:
# 열 이름, 행 인덱스
df['지역']['서울'], df.지역['서울'], df.지역.서울

('수도권', '수도권', '수도권')

In [121]:
# column명이 숫자이므로 성립하지 않는다.
df['2015']['서울'], df.2015['서울'], df.2015.서울

SyntaxError: invalid syntax (3259648061.py, line 1)

- 연습문제 4.1.3

In [123]:
data = {
    "국어": [80, 90, 70, 30],
    "영어": [90, 70, 60, 40],
    "수학": [90, 60, 80, 70],
}
columns = ["국어", "영어", "수학"]
index = ["춘향", "몽룡", "향단", "방자"]
df6 = pd.DataFrame(data, index=index, columns=columns)
df6

    국어  영어  수학
춘향  80  90  90
몽룡  90  70  60
향단  70  60  80
방자  30  40  70

In [125]:
df6['수학']

춘향    90
몽룡    60
향단    80
방자    70
Name: 수학, dtype: int64

In [128]:
df6[['국어', '영어']]

    국어  영어
춘향  80  90
몽룡  90  70
향단  70  60
방자  30  40

In [154]:
df6['평균'] = ((df6.국어 + df6.영어 + df6.수학)/3).round(1)
df6

    국어  영어  수학    평균
춘향  80  90  90  86.7
몽룡  90  70  60  73.3
향단  70  60  80  70.0
방자  30  80  70  60.0

In [157]:
import warnings
df6['영어']['방자'] = 80

C:\Users\YONSAI\AppData\Local\Temp\ipykernel_6660\188406585.py:2: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  df6['영어']['방자'] = 80

In [158]:
df.T[['춘향']]

    춘향
국어  80
영어  90
수학  90

In [160]:
df[:1]

    국어  영어  수학
춘향  80  90  90

In [159]:
df.T['향단']

국어    70
영어    60
수학    80
Name: 향단, dtype: int64